{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "env: NEO4J_URL=http://neo4j:neo4j2@localhost:7474\n"
     ]
    }
   ],
   "source": [
    "%matplotlib inline\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import matplotlib.pyplot as plt\n",
    "# New imports for using Neo4j\n",
    "import networkx as nx\n",
    "from py2neo import Graph\n",
    "from helpers.vis import draw\n",
    "%set_env NEO4J_URL http://neo4j:neo4j2@localhost:7474\n",
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "graph = Graph('http://neo4j:neo4j2@localhost:7474')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# function to search columns of a pandas dataframe\n",
    "def search(df, col, words):\n",
    "    cond = [df[col].str.contains('(?<![\\w\\d])'+w+'(?![\\w\\d])', case=False, na=False) for w in words]\n",
    "    return df[np.logical_and.reduce(cond)]\n",
    "\n",
    "# split a string in words with no ponctuation\n",
    "import re\n",
    "def split(str):\n",
    "    return re.split('\\W+', str)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# load datasets\n",
    "from helpers.swiss_codes import filter_swiss\n",
    "# 1. officers\n",
    "officers = pd.read_csv('../data/panama/Officers.csv', header=0, low_memory=False)\n",
    "swiss_officers = filter_swiss(officers, process_address=False)\n",
    "del officers\n",
    "# 2. entities\n",
    "entities = pd.read_csv('../data/panama/Entities.csv', header=0, low_memory=False)\n",
    "swiss_entities = filter_swiss(entities)\n",
    "del entities\n",
    "# 3. intermediaries\n",
    "inter = pd.read_csv('../data/panama/Intermediaries.csv', header=0, low_memory=False)\n",
    "swiss_inter = filter_swiss(inter)\n",
    "del inter"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## All interests"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "all_interests = pd.read_json('data/all_interests.json')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Looking for names in Officers:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "rs = []\n",
    "for _,f,l in all_interests[['first_name','last_name']].drop_duplicates().itertuples():\n",
    "    ws = f + ' ' + l\n",
    "    r = search(swiss_officers, 'name', split(ws))\n",
    "    if r.size > 0 or l == 'Zacharias':\n",
    "        rs.append(ws)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Mauro Poggia', 'Ronald Zacharias']"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rs"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And the companies from Entities and Intermedietaries:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "ints = []\n",
    "for interest in all_interests['interest_name'].drop_duplicates():\n",
    "    ws = split(interest)\n",
    "    r = search(swiss_inter, 'name', ws)\n",
    "    if r.size > 0:\n",
    "        ints.append([interest, r['name']])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ints"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "try:\n",
    "    inters = pd.read_csv('data/all_interests_entities_name.csv', index_col=0)\n",
    "except:\n",
    "    ents = []\n",
    "    for interest in all_interests['interest_name'].drop_duplicates():\n",
    "        ws = split(interest)\n",
    "        r = search(swiss_entities, 'name', ws)\n",
    "        if r.size > 0:\n",
    "            for idx,name in r['name'].iteritems():\n",
    "                ents.append([interest.strip(),idx,name])\n",
    "    inters = pd.DataFrame(ents, columns=['interest_name','idx','entity_name'])\n",
    "    inters.to_csv('data/all_interests_entities_name.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>interest_name</th>\n",
       "      <th>idx</th>\n",
       "      <th>entity_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SVK</td>\n",
       "      <td>119433</td>\n",
       "      <td>SVK INVEST INTERNATIONAL LIMITED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Aresa</td>\n",
       "      <td>173209</td>\n",
       "      <td>ARESA FINANCE LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ASCA</td>\n",
       "      <td>53521</td>\n",
       "      <td>ASCA MANAGEMENT LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>31154</td>\n",
       "      <td>ARGOS BUILDING CORPORATION LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>CIA</td>\n",
       "      <td>2137</td>\n",
       "      <td>J. MARQUES AND CIA. S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>CADES</td>\n",
       "      <td>51038</td>\n",
       "      <td>CADES FINANCE LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>3649</td>\n",
       "      <td>ARGOS HOLDING LIMITED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Nature</td>\n",
       "      <td>28487</td>\n",
       "      <td>NATURE ASSETS S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>energo</td>\n",
       "      <td>10568</td>\n",
       "      <td>ENERGO COMPANY S.A.</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  interest_name     idx                       entity_name\n",
       "0           SVK  119433  SVK INVEST INTERNATIONAL LIMITED\n",
       "1         Aresa  173209                ARESA FINANCE LTD.\n",
       "2          ASCA   53521              ASCA MANAGEMENT LTD.\n",
       "3         ARGOS   31154   ARGOS BUILDING CORPORATION LTD.\n",
       "4           CIA    2137          J. MARQUES AND CIA. S.A.\n",
       "5         CADES   51038                CADES FINANCE LTD.\n",
       "6         ARGOS    3649             ARGOS HOLDING LIMITED\n",
       "7        Nature   28487                NATURE ASSETS S.A.\n",
       "8        energo   10568               ENERGO COMPANY S.A."
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "inters"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "These matches have to be checked more in details as they seem to mean something else...\n",
    "\n",
    "## Parlement data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 226,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "parlement = pd.read_json('data/parliament_members_interests.json')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 227,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "ps = []\n",
    "for _,f,l in parlement[['FirstName','LastName']].drop_duplicates().itertuples():\n",
    "    ws = f + ' ' + l\n",
    "    r = search(swiss_officers, 'name', split(ws))\n",
    "    if r.size > 0:\n",
    "        ps.append(ws)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 228,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Peter Schmid',\n",
       " 'Heinrich Baumann',\n",
       " 'Johann Jakob',\n",
       " 'Peter Müller',\n",
       " 'Rudolf Ott',\n",
       " 'Mauro Poggia']"
      ]
     },
     "execution_count": 228,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ps"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "parl_ints = set()\n",
    "for ints in parlement['Interests']:\n",
    "    for i in ints:\n",
    "        name = i['InterestName']\n",
    "        parl_ints.add(name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "pis = []\n",
    "for p in parl_ints:\n",
    "    r = search(swiss_inter, 'name', split(p))\n",
    "    if r.size > 0:\n",
    "        pis.append(p)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['energo']"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pis"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Only one match and there're a lot of possibilities with this name...\n",
    "\n",
    "### Querying the Neo4j with Poggia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 273,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>name</th>\n",
       "        <th>countries</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Mauro Poggia</td>\n",
       "        <td>Switzerland</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Mauro Poggia', 'Switzerland']]"
      ]
     },
     "execution_count": 273,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher \n",
    "MATCH (o:Officer) WHERE toLower(o.name) CONTAINS \"poggia\" and o.country_codes contains \"CHE\"\n",
    "RETURN o.name as name, o.countries as countries LIMIT 20"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Plotting Poggia's graph\n",
    "results = %cypher \\\n",
    "    MATCH (o1:Officer) WHERE toLower(o1.name) CONTAINS \"poggia\" \\\n",
    "    match p=(o1)-[r*1..100]-() \\\n",
    "    RETURN p limit 100"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 280,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-c5849385-a746-4adb-bc30-4c338bed49c5.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x11fa07b00>"
      ]
     },
     "execution_count": 280,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "G = results.get_graph()\n",
    "draw(G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 262,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Plotting energo graph\n",
    "results2 = %cypher \\\n",
    "    MATCH (o1:Entity) WHERE toLower(o1.name) CONTAINS \"energo\" \\\n",
    "    match p=(o1)-[r*1..100]-() \\\n",
    "    RETURN p limit 100"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 263,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-03cc4eb8-5fe5-43a5-970e-148ac1aae62f.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x11e2396d8>"
      ]
     },
     "execution_count": 263,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "G2 = results2.get_graph()\n",
    "draw(G2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can see results in Morges and Porrentruy (+ Russia, Spain, Panama) all centralized around GENINT SA  \n",
    "http://ge.ch/hrcintapp/externalCompanyReport.action?companyOfrcId13=CH-660-0806985-5&ofrcLanguage=2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 253,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Plotting a graph concerning the IMD school in Lausanne\n",
    "results3 = %cypher \\\n",
    "    MATCH (o1:Address) WHERE toLower(o1.address) CONTAINS \"schmidheiny\" \\\n",
    "    match p=(o1)<-[r*1..100]-() \\\n",
    "    RETURN p limit 20"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-a4f26f62-a04b-4e1e-a2ef-2cb794575c3a.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x117a7cb70>"
      ]
     },
     "execution_count": 254,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "G3 = results3.get_graph()\n",
    "draw(G3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [Root]",
   "language": "python",
   "name": "Python [Root]"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
