{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "env: NEO4J_URL=http://neo4j:neo4j2@localhost:7474\n"
     ]
    }
   ],
   "source": [
    "%matplotlib inline\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import matplotlib.pyplot as plt\n",
    "# New imports for using Neo4j\n",
    "import networkx as nx\n",
    "from py2neo import Graph\n",
    "from helpers.vis import draw\n",
    "%set_env NEO4J_URL http://neo4j:neo4j2@localhost:7474\n",
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "graph = Graph('http://neo4j:neo4j2@localhost:7474')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# function to search columns of a pandas dataframe\n",
    "def search(df, col, words):\n",
    "    cond = [df[col].str.contains('(?<![\\w\\d])'+w+'(?![\\w\\d])', case=False, na=False) for w in words]\n",
    "    return df[np.logical_and.reduce(cond)]\n",
    "\n",
    "# split a string in words with no ponctuation\n",
    "import re\n",
    "def split(str):\n",
    "    return re.split('\\W+', str)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# load datasets\n",
    "from helpers.swiss_codes import filter_swiss\n",
    "# 1. officers\n",
    "officers = pd.read_csv('../data/panama/Officers.csv', header=0, low_memory=False)\n",
    "swiss_officers = filter_swiss(officers, process_address=False)\n",
    "del officers\n",
    "# 2. entities\n",
    "entities = pd.read_csv('../data/panama/Entities.csv', header=0, low_memory=False)\n",
    "swiss_entities = filter_swiss(entities)\n",
    "del entities\n",
    "# 3. intermediaries\n",
    "inter = pd.read_csv('../data/panama/Intermediaries.csv', header=0, low_memory=False)\n",
    "swiss_inter = filter_swiss(inter)\n",
    "del inter"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## All interests"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "all_interests = pd.read_json('data/all_interests.json')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Looking for names in Officers:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "rs = []\n",
    "for _,f,l in all_interests[['first_name','last_name']].drop_duplicates().itertuples():\n",
    "    ws = f + ' ' + l\n",
    "    r = search(swiss_officers, 'name', split(ws))\n",
    "    if r.size > 0 or l == 'Zacharias':\n",
    "        rs.append(ws)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Mauro Poggia', 'Ronald Zacharias']"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rs"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And the companies from Entities and Intermedietaries:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "try:\n",
    "    inters = pd.read_csv('data/all_interests_entities_name.csv', index_col=0)\n",
    "except:\n",
    "    ents = []\n",
    "    for interest in all_interests['interest_name'].drop_duplicates():\n",
    "        ws = split(interest)\n",
    "        r = search(swiss_entities, 'name', ws)\n",
    "        if r.size > 0:\n",
    "            for idx,name in r['name'].iteritems():\n",
    "                ents.append([interest.strip(),idx,name])\n",
    "    inters = pd.DataFrame(ents, columns=['interest_name','idx','entity_name'])\n",
    "    inters.to_csv('data/all_interests_entities_name.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>interest_name</th>\n",
       "      <th>idx</th>\n",
       "      <th>entity_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SVK</td>\n",
       "      <td>119433</td>\n",
       "      <td>SVK INVEST INTERNATIONAL LIMITED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SVK</td>\n",
       "      <td>150129</td>\n",
       "      <td>SVK FOUNDATION</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aresa</td>\n",
       "      <td>173209</td>\n",
       "      <td>ARESA FINANCE LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ASCA</td>\n",
       "      <td>53521</td>\n",
       "      <td>ASCA MANAGEMENT LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>31154</td>\n",
       "      <td>ARGOS BUILDING CORPORATION LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>38862</td>\n",
       "      <td>ARGOS S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>148117</td>\n",
       "      <td>ARGOS-REALCO S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>152462</td>\n",
       "      <td>ARGOS (GULF) S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>164409</td>\n",
       "      <td>ARGOS TRADING LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>268869</td>\n",
       "      <td>Argos Inter Invest Ltd.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>CIA</td>\n",
       "      <td>2137</td>\n",
       "      <td>J. MARQUES AND CIA. S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>CADES</td>\n",
       "      <td>51038</td>\n",
       "      <td>CADES FINANCE LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>3649</td>\n",
       "      <td>ARGOS HOLDING LIMITED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>31154</td>\n",
       "      <td>ARGOS BUILDING CORPORATION LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>38862</td>\n",
       "      <td>ARGOS S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>148117</td>\n",
       "      <td>ARGOS-REALCO S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>152462</td>\n",
       "      <td>ARGOS (GULF) S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>164409</td>\n",
       "      <td>ARGOS TRADING LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>190341</td>\n",
       "      <td>ARGOS FOUNDATION</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>ARGOS</td>\n",
       "      <td>268869</td>\n",
       "      <td>Argos Inter Invest Ltd.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Nature</td>\n",
       "      <td>28487</td>\n",
       "      <td>NATURE ASSETS S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>energo</td>\n",
       "      <td>10568</td>\n",
       "      <td>ENERGO COMPANY S.A.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>energo</td>\n",
       "      <td>13992</td>\n",
       "      <td>CAN-ENERGO (HOLDING) LIMITED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>energo</td>\n",
       "      <td>84835</td>\n",
       "      <td>ENERGO TEHNIKA LTD.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>energo</td>\n",
       "      <td>176484</td>\n",
       "      <td>SIGMA ENERGO LTD.</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   interest_name     idx                       entity_name\n",
       "0            SVK  119433  SVK INVEST INTERNATIONAL LIMITED\n",
       "1            SVK  150129                    SVK FOUNDATION\n",
       "2          Aresa  173209                ARESA FINANCE LTD.\n",
       "3           ASCA   53521              ASCA MANAGEMENT LTD.\n",
       "4          ARGOS   31154   ARGOS BUILDING CORPORATION LTD.\n",
       "5          ARGOS   38862                        ARGOS S.A.\n",
       "6          ARGOS  148117                 ARGOS-REALCO S.A.\n",
       "7          ARGOS  152462                 ARGOS (GULF) S.A.\n",
       "8          ARGOS  164409                ARGOS TRADING LTD.\n",
       "9          ARGOS  268869           Argos Inter Invest Ltd.\n",
       "10           CIA    2137          J. MARQUES AND CIA. S.A.\n",
       "11         CADES   51038                CADES FINANCE LTD.\n",
       "12         ARGOS    3649             ARGOS HOLDING LIMITED\n",
       "13         ARGOS   31154   ARGOS BUILDING CORPORATION LTD.\n",
       "14         ARGOS   38862                        ARGOS S.A.\n",
       "15         ARGOS  148117                 ARGOS-REALCO S.A.\n",
       "16         ARGOS  152462                 ARGOS (GULF) S.A.\n",
       "17         ARGOS  164409                ARGOS TRADING LTD.\n",
       "18         ARGOS  190341                  ARGOS FOUNDATION\n",
       "19         ARGOS  268869           Argos Inter Invest Ltd.\n",
       "20        Nature   28487                NATURE ASSETS S.A.\n",
       "21        energo   10568               ENERGO COMPANY S.A.\n",
       "22        energo   13992      CAN-ENERGO (HOLDING) LIMITED\n",
       "23        energo   84835               ENERGO TEHNIKA LTD.\n",
       "24        energo  176484                 SIGMA ENERGO LTD."
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "inters"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "These matches have to be checked more in details as they seem to mean something else...\n",
    "\n",
    "## Parlement data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "parlement = pd.read_json('data/parliament_members_interests.json')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "ps = []\n",
    "for _,f,l in parlement[['FirstName','LastName']].drop_duplicates().itertuples():\n",
    "    ws = f + ' ' + l\n",
    "    r = search(swiss_officers, 'name', split(ws))\n",
    "    if r.size > 0:\n",
    "        ps.append(ws)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Peter Schmid',\n",
       " 'Heinrich Baumann',\n",
       " 'Johann Jakob',\n",
       " 'Peter Müller',\n",
       " 'Rudolf Ott',\n",
       " 'Mauro Poggia']"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ps"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Only some matches and there're a lot of possibilities with these names...\n",
    "\n",
    "### Querying the Neo4j with Poggia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>name</th>\n",
       "        <th>countries</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Mauro Poggia</td>\n",
       "        <td>Switzerland</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Mauro Poggia', 'Switzerland']]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher \n",
    "MATCH (o:Officer) WHERE toLower(o.name) CONTAINS \"poggia\"\n",
    "RETURN o.name as name, o.countries as countries LIMIT 20"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Plotting Poggia's graph\n",
    "results = %cypher \\\n",
    "    MATCH (o:Officer) WHERE toLower(o.name) CONTAINS \"poggia\" \\\n",
    "    match p=(o)-[r*1..100]-() \\\n",
    "    RETURN p limit 100"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-4e069784-1379-463c-bde8-873c7c5e4789.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x120f40748>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "G = results.get_graph()\n",
    "draw(G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Plotting energo graph\n",
    "results2 = %cypher \\\n",
    "    MATCH (o1:Entity) WHERE toLower(o1.name) CONTAINS \"energo\" \\\n",
    "    match p=(o1)-[r*1..100]-() \\\n",
    "    RETURN p limit 100"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-29ff4b2d-044d-4464-a4e9-260c1aeac67e.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x1209678d0>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "G2 = results2.get_graph()\n",
    "draw(G2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can see results in Morges and Porrentruy (+ Russia, Spain, Panama) all centralized around GENINT SA  \n",
    "http://ge.ch/hrcintapp/externalCompanyReport.action?companyOfrcId13=CH-660-0806985-5&ofrcLanguage=2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 rows affected.\n"
     ]
    }
   ],
   "source": [
    "# Plotting a graph concerning the IMD school in Lausanne ;)\n",
    "results3 = %cypher \\\n",
    "    MATCH (o1:Address) WHERE toLower(o1.address) CONTAINS \"schmidheiny\" \\\n",
    "    match p=(o1)<-[r*1..100]-() \\\n",
    "    RETURN p limit 20"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-5f0a3b78-319b-40fb-8f93-43c73d43d635.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x120e65b00>"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "G3 = results3.get_graph()\n",
    "draw(G3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [Root]",
   "language": "python",
   "name": "Python [Root]"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
